Repository: pewpew-game/pewpew-docs-de
Catalog: docs/locale/*/LC_MESSAGES/pew.po
Languages: de

source: PewPew Library Reference
de: Referenz zur PewPew-Bibliothek

source: Initialize the module.
de: Initialisiert das Modul.

source: This function switches the display on and performs some basic setup.
de: Diese Funktion schaltet das Display ein und macht die Bibliothek betriebsbereit.

source: Set the brightness of the display, from 0 (minimum) to 15 (maximum). On devices that don't support varying the brightness this does nothing.
de: Setzt die Display-Helligkeit, von 0 (minimal) bis 15 (maximal). Auf Geräten, welche die Helligkeit nicht ändern können, hat die Funktion keinen Effekt.

source: Show the provided image on the display, starting at the top left corner. You will want to call this once for every frame.
de: Zeigt das übergebene Bild auf dem Display, in der oberen linken Ecke platziert. Du wirst das ein Mal pro Frame aufrufen wollen.

source: Return a number telling which keys (or buttons) have been pressed since the last check. The number can then be filtered with the ``&`` operator and the ``K_X``, ``K_DOWN``, ``K_LEFT``, ``K_RIGHT``, ``K_UP``, and ``K_O`` constants to see whether any of the keys was pressed.
de: Gibt eine Zahl zurück, die angibt, welche Tasten seit dem letzten Aufruf gedrückt wurden oder immer noch gedrückt sind. Diese Zahl kann dann mit dem Operator ``&`` und den Konstanten ``K_X``, ``K_DOWN``, ``K_LEFT``, ``K_RIGHT``, ``K_UP`` und ``K_O`` gefiltert werden, um zu sehen, ob eine bestimmte Taste gedrückt war.

source: Wait until ``delay`` seconds have passed since the last call to this function. You can call it every frame to ensure a constant frame rate.
de: Wartet, bis ``delay`` Sekunden vergangen sind seit dem letzten Aufruf. Du kannst das in jedem Frame aufrufen, um eine konstante Frame-Rate zu erreichen.

source: Pix represents a drawing surface, ``width`` pixels wide and ``height`` pixels high.
de: Ein Pix ist eine Zeichenfläche (ein Bild), ``width`` Pixel breit und ``height`` Pixel hoch.

source: If no ``buffer`` is specified for storing the data, a suitable one will be automatically created.
de: Wenn kein ``buffer`` angegeben wird, um die Bilddaten zu speichern, wird automatisch ein passender angelegt.

source: Creates a new Pix and initialzes its contents by iterating over ``lines`` and then over individual pixels in each line. All the lines have to be at least as long as the first one.
de: Macht ein neues Pix und initialisiert seinen Inhalt, indem über die Zeilen ``lines`` und dann über einzelne Pixel innerhalb jeder Zeile iteriert wird. Alle Zeilen müssen mindestens so lang sein wie die erste.

source: Creates a new Pix and renders the specified text on it. It is exactly the size needed to fit the specified text. Newlines and other control characters are rendered as spaces.
de: Macht ein neues Pix und schreibt den angegebenen Text hinein. Es erhält genau die Grösse, die für den Text nötig ist. Zeilenumbrüche und andere Spezialzeichen werden als Leerzeichen dargestellt.

source: If ``color`` is not specified, it will use yellow and red for the letters by default. Otherwise it will use the specified color, with ``background`` color as the background.
de: Wenn keine Farbe ``color`` angegeben ist, werden die Buchstaben aus verschiedenfarbigen Pixeln bestehen. Ansonsten wird die angegebene Farbe verwendet, mit ``background`` als Hintergrundfarbe.

source: Alternatively, ``colors`` may be specified as a 4-tuple of colors, and then the ``color`` and ``background`` arguments are ignored, and the four specified colors are used for rendering the text.
de: Alternativ kann als ``colors`` ein 4-Tupel von Farben angegeben werden, die Argumente ``color`` und ``background`` werden dann ignoriert und stattdessen diese vier Farben verwendet.

source: If ``color`` is specified, sets the pixel at location ``x``, ``y`` to that color. If not, returns the color of the pixel at that location.
de: Falls ``color`` angegeben ist, wird das Pixel an der Position ``x``, ``y`` auf diese Farbe gesetzt. Ansonsten wird die aktuelle Farbe dieses Pixels zurückgegeben.

source: If the location is out of bounds of the drawing surface, returns 0.
de: Falls die Position ausserhalb der Zeichenfläche liegt, wird 0 zurückgegeben.

source: Draws a filled box with the specified ``color`` with its top left corner at the specified location and of the specified size. If no location and size are specified, fills the whole drawing surface.
de: Zeichnet ein gefülltes Rechteck in der Farbe ``color`` mit oberer linker Ecke bei ``x``, ``y``, Breite ``width`` und Höhe ``height``. Wenn keine Position und Grösse angegeben sind, wird die gesamte Zeichenfläche ausgefüllt.

source: Copied the ``source`` drawing surface onto this surface at location specified with ``dx`` and ``dy``.
de: Kopiert die Zeichenfläche ``source`` auf diese Zeichenfläche an der Position ``dx``, ``dy``.

source: If ``x``, ``y``, ``widht`` and ``height`` are specified, only copies that fragment of the ``source`` image, otherwise copies it whole.
de: Wenn ``x``, ``y``, ``width`` und ``height`` angegeben sind, wird nur dieser Ausschnitt des Quell-Bildes kopiert, ansonsten das gesamte Bild.

source: If ``key`` color is specified, that color is considered transparent on the source image, and is not copied onto this drawing surface.
de: Wenn eine Farbe ``key`` angegeben ist, wird diese Farbe im Quell-Bild als transparent betrachtet und nicht auf diese Zeichenfläche kopiert.
