Repository: pewpew-game/pewpew-docs-de
Catalog: docs/locale/*/LC_MESSAGES/tutorial.po
Languages: de

source: Bouncing Ball Tutorial
de: Gummiball Tutorial

source: Let's try to write a simple bouncing ball demo, where a single pixel moves around the screen and bounces off its edges. This will let us get familiar with the library.
de: Versuchen wir doch 'mal, eine einfache Gummiball-Demo zu schreiben, bei der sich ein einzelnes Pixel über den Bildschirm bewegt und an dessen Rand abprallt. Dies wird uns mit der Library vertraut machen.

source: Start by creating a file called "code.py" --- that is where all our code will go. As long as such a file exists, PewPew will try to run it on startup and on reset. Later, when you finish working on your game, you can rename it to whatever you call your game, and then PewPew will fall back to running "main.py", which contains the game selection menu.
de: Beginne, indem du eine Datei mit dem Namen "code.py" erstellst --- darin schreiben wir all unseren Code. Solange eine solch genannte Datei existiert, wird PewPew beim Auf- oder Neustarten versuchen es auszuführen. Später, wenn du mit deinem Game fertig bist, kannst du ihm einen beliebigen neuen Namen geben, und dann wird PewPew wieder standardgemäss "main.py" ausführen, welches das Spielauswahlmenü beinhaltet.

source: To use the PewPew library, we need to first import it into our code. So we need to start with this line::
de: Um die PewPew Library zu benützen, müssen wir sie zuerst in unseren Code importieren. Dafür müssen wir mit der folgenden Zeile beginnen::

source: Then we need to tell the library to switch the display on and generally prepare everything for displaying our ball. We do that by calling the ``init`` function like this::
de: Dann müssen wir die Library anweisen, den Bildschirm anzuschalten und generell alles vorzubereiten, was wir brauchen, um den Gummiball anzuzeigen. Das machen wir, indem wir die ``init`` Funktion wie folgt aufrufen::

source: We will want our demo program to run all the time in a loop, so we will need an infinite loop. We can limit the loop's speed to run 12 times a second, which is slow enough to see the movements, but not too slow::
de: Wir möchten, dass unsere Demo die ganze Zeit in einer Schleife läuft, dafür brauchen wir eine Endlosschleife. Wir können die Wiederholungen pro Sekunde auf 12 begrenzen, was langsam genug ist, um die Bewegungen zu sehen, aber nicht allzu langsam::

source: Now, we will need an image that we will display on the screen. In PewPew, images are represented as ``Pix`` objects. So we can create an empty image the size of the display, and display it in our loop::
de: Des Weiteren brauchen wir ein Bild, das wir auf dem Bildschirm anzeigen werden. In PewPew werden Bilder als ``Pix`` Objekte repräsentiert. Nun können wir ein leeres Bild in der Grösse des gesamten Bildschirms erstellen und innerhalb unserer Endlosschleife darstellen::

source: Now we will add our pixel. We will make it start at coordinates ``0, 0``, and we will draw it with color ``3``, which is the brightest::
de: Jetzt fügen wir unser Pixel hinzu. Wir setzen dessen Ausgangsposition bei den Koordinaten ``0, 0`` und geben ihm die Farbe ``3``, welches die hellste ist::

source: Now let's make the pixel actually move::
de: Und nun setzen wir unser Pixel in Bewegung::

source: After running this, you will see a diagonal line on the display. That's because the old positions of the pixel are not getting deleted. And the pixel keeps on going forever outside the screen. We can fix that. Let's start by deleting the old position::
de: Wenn du das jetzt ausführst, wirst du sehen, wie sich auf dem Bildschirm eine Diagonale bildet. Das liegt daran, dass die vorherigen Positionen nicht gelöscht werden. Ausserdem bewegt sich das Pixel weiterhin in diese Richtung, ausserhalb des Bildschirms. Diese Probleme können wir beheben. Beginnen wir damit, die vorherigen Positionen zu löschen::

source: We simply draw a black pixel at the old position before drawing a bright one at the new one. Since we only update the screen once a frame, those two operations are visible at the same time. Now, let's make the pixel bounce off the edges::
de: Wir färben einfach das Pixel an der vorherigen Position wieder schwarz, bevor wir das helle Pixel an der neuen Position zeichnen. Da wir den Bildschirm nur einmal pro Frame neu laden, sind beide Veränderungen zur gleichen Zeit sichtbar. Und nun, lass uns dem Pixel die Fähigkeit geben, von den Wänden abzuprallen::

source: We had to move our starting point a bit, because otherwise it will get stuck in the corner. Now you should see our pixel going from one corner to the other. That's neat, but a little bit boring. Maybe if we changed the starting position it would be better::
de: Wir mussten die Ausgangsposition ein wenig verschieben, da das Pixel ansonsten in der Ecke feststecken würde. Jetzt solltest du sehen, wie unser Pixel von Ecke zu Ecke springt. Das ist immerhin schon etwas, aber nicht interessant genug. Vielleicht wäre es besser, wenn wir die Ausgangsposition verändern würden::

source: Maybe we could affect the ball's behavior with the buttons? For instance, pressing `O` could make it bounce horizontally, and pressing `X` vertically::
de: Vielleicht können wir das Verhalten des Gummiballs mit den Tasten beeinflussen? Beispielsweise könnte man es mit der `O` Taste horizontal und mit der `X` Taste vertikal abspringen lassen::

source: Could we have a nicer background than just black? Let's try a check board::
de: Können wir einen schöneren Hintergrund als nur schwarz haben? Versuchen wir's mit einem Schachbrett::

source: Instead of deleting our pixel with a black pixel, we simply copy the whole background all over the screen, and then draw our pixel in the new position.
de: Anstatt dass wir jedes Mal unser Pixel mit einem schwarzen Pixel ersetzen, kopieren wir einfach den gesamten Hintergrund und fügen ihn wieder ein, dann zeichnen wir unser Pixel an seiner neuen Position.

source: How about making the ball larger::
de: Wie wäre es, wenn wir den Gummiball grösser machen::

source: We had to adjust the boundaries of the screen for the larger ball here.
de: Wir mussten die Grenzen des Bildschirms anpassen, da der Gummiball grösser wurde.

source: Now experiment with this code yourself and see what you can make.
de: Experimentiere jetzt mit diesem Code auf eigene Faust und sieh was du damit machen kannst.
